/*
 * ComparatorA.c
 *描述：由Grace自动生成的比较器配置代码
 *比较器的同相端连接P1.5，反相端使用内部0.25VCC参考电压。
*比较器输出启用了滤波器，比较器的输出直接从内部连到捕获模块Timer_A CCI1B上
 *  Created on: 2013-4-3
 *      Author: Administrator
 */

#include <msp430.h>

/******************************************************************************************************
 * 名       称：Comparator_Aplus_init()
 * 功       能：比较器模块初始化，从Grace移植
 * 入口参数：无
 * 出口参数：无
 * 说       明：比较器的同相端连接P1.5，反相端使用内部0.25VCC参考电压，比较器输出
 *                   启用了滤波器，比较器的输出直接从内部连到捕获模块Timer_A CCI1B上。
 * 范       例：无
 ******************************************************************************************************/
void Comparator_Aplus_init(void)
{
    CACTL1 = CAEX + CAREF_1 + CAON;
    CACTL2 = P2CA3 + P2CA1 + CAF;
    CAPD = CAPD5;
}
