/*
 * Slope.c
 *
 *  Created on: 2013-4-3
 *      Author: Administrator
 */
#include "MSP430G2553.h"
#include "Timer_A3.h"
#include "ComparatorA.h"
#define PORT_REF_LOW 		P1DIR |= BIT3;P1OUT &=~BIT3		//参考电阻所接IO输出0
#define PORT_REF_HIGH 		P1DIR |= BIT3;P1OUT |=BIT3			//参考电阻所接IO输出1
#define PORT_REF_HZ			P1DIR &= ~BIT3								//参考电阻所接IO高阻
#define PORT_SENS_LOW	 	P2DIR |= BIT2;P2OUT &=~BIT2		//传感器电阻所接IO输出0
#define PORT_SENS_HIGH	P2DIR |= BIT2;P2OUT |=BIT2			//传感器电阻所接IO输出1
#define PORT_SENS_HZ		 P2DIR &=~BIT2								//传感器电阻所接IO输出高阻
#define TAR_CLEAR				TA0CTL |= TACLR							//清除T主A时钟计数值

unsigned char Slope_Measure_Flag=0;			//全局变量标志，用于识别当前所测的是什么电阻
unsigned int R_REF=0;			//全局变量，参考电阻的相对“电阻值”
unsigned int R_SENS=0;		//全局变量，传感器电阻的相对“电阻值”
/******************************************************************************************************
 * 名       称：Slope_Port_Charge()
 * 功       能：开启充电电源，一直将积分电容上的电充满
 * 入口参数：无
 * 出口参数：无
 * 说       明：充满电后，等待放电信号。
 * 范       例：无
 ******************************************************************************************************/
void Slope_Port_Charge()
{
	PORT_SENS_HIGH;
	PORT_REF_HIGH;
}
/******************************************************************************************************
 * 名       称：Slope_Measure_Init()
 * 功       能：初始化各硬件模块，给电容充满电等待第一次放电测量
 * 入口参数：无
 * 出口参数：无
 * 说       明：无
 * 范       例：无
 ******************************************************************************************************/
void Slope_Measure_Init()
{
	Comparator_Aplus_init();
	Timer0_A3_init();
	Slope_Port_Charge();
}
/******************************************************************************************************
 * 名       称：Slope_Measure_REF()
 * 功       能：启动参考电阻的测量
 * 入口参数：无
 * 出口参数：无
 * 说       明：无
 * 范       例：无
 ******************************************************************************************************/
void  Slope_Measure_REF()
{
	Slope_Measure_Flag=0;			//置全局变量标志，表明此次测量的是参考电阻
	PORT_SENS_HZ;						//传感器电阻所连IO高阻，去除对电路影响
	TAR_CLEAR;								//TA主时钟清零
	PORT_REF_LOW;						//开启参考电阻放电通道，开始计数测量放电时间
}
/******************************************************************************************************
 * 名       称：Slope_Measure_SENS()
 * 功       能：启动传感器电阻的测量
 * 入口参数：无
 * 出口参数：无
 * 说       明：无
 * 范       例：无
 ******************************************************************************************************/
void Slope_Measure_SENS()
{
	Slope_Measure_Flag=1;			//置全局变量标志，表明此次测量的是传感器电阻
	PORT_REF_HZ;						//参考电阻所连IO高阻，去除对电路影响
	TAR_CLEAR;								//TA主时钟清零
	PORT_SENS_LOW;					//开启传感器电阻放电通道，开始计数测量放电时间
}
/******************************************************************************************************
 * 名       称：Slope_TA_CCI1B()
 * 功       能：针对Slope应用的捕获中断事件处理函数，测得电阻值
 * 入口参数：无
 * 出口参数：无
 * 说       明：根据标识位，判断本次测量的是参考电阻还是传感器电阻
 * 范       例：无
 ******************************************************************************************************/
void Slope_TA_CCI1B()
{
	switch(Slope_Measure_Flag)
	{
		case 0 : 	R_REF= TA0CCR1;			break;
		case 1 :	R_SENS= TA0CCR1;	    break;
		default:	break;
	}
}


